# Exploring a DataFrame

## Setup

In [1]:
import numpy as np
import pandas as pd

pd.set_option('display.max_columns', 10)
pd.set_option('display.max_rows', 10)

## Create DataFrame from mantle.csv
Get the first seven columns and use 'Year' as the index column.

In [2]:
csv ='../csvs/mantle.csv'
mantle = pd.read_csv(csv, usecols=[0,1,2,3,4,5,6], index_col=['Year'])

## Explore DataFrame
Get the column names, index, and the number of rows and columns

In [3]:
mantle.columns

Index(['Tm', 'G', 'PA', 'AB', 'R', 'H'], dtype='object')

In [4]:
mantle.index

Int64Index([1951, 1952, 1953, 1954, 1955, 1956, 1957, 1958, 1959, 1960, 1961,
            1962, 1963, 1964, 1965, 1966, 1967, 1968],
           dtype='int64', name='Year')

In [5]:
mantle.shape

(18, 6)

## Get quick information on the data
For example, counts, means, mins and maxes

In [6]:
mantle.describe()

                G          PA          AB           R           H
count   18.000000   18.000000   18.000000   18.000000   18.000000
mean   133.388889  550.388889  450.111111   93.111111  134.166667
std     23.364475  122.925678  100.072261   33.585517   36.361340
min     65.000000  213.000000  172.000000   40.000000   54.000000
25%    124.000000  511.500000  391.500000   61.500000  104.250000
50%    144.000000  595.000000  469.500000  100.000000  143.000000
75%    146.750000  642.250000  525.000000  121.000000  161.750000
max    153.000000  654.000000  549.000000  132.000000  188.000000

## Get the first three rows of data

In [7]:
mantle.head(3)

       Tm    G   PA   AB    R    H
Year
1951  NYY   96  386  341   61   91
1952  NYY  142  626  549   94  171
1953  NYY  127  540  461  105  136

## Get the last three rows of data

In [8]:
mantle.tail(3)

       Tm    G   PA   AB   R    H
Year
1966  NYY  108  393  333  40   96
1967  NYY  144  553  440  63  108
1968  NYY  144  547  435  57  103

## Get just the AB and H columns

In [9]:
mantle[['AB','H']]

       AB    H
Year
1951  341   91
1952  549  171
1953  461  136
1954  543  163
1955  517  158
...   ...  ...
1964  465  141
1965  361   92
1966  333   96
1967  440  108
1968  435  103

[18 rows x 2 columns]